NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/
#include <string.h>
#include "dfu_mesh.h"
#include "sha256.h"
#include "dfu_transfer_mesh.h"
#include "dfu_types_mesh.h"
#include "uECC.h"
#include "bootloader_info.h"
#include "bootloader_app_bridge.h"
#include "nrf_mbr.h"

/*****************************************************************************
* Local defines
*****************************************************************************/
#define TX_REPEATS_DEFAULT          (3)
#define TX_REPEATS_FWID             (TX_REPEATS_INF)
#define TX_REPEATS_DFU_REQ          (TX_REPEATS_INF)
#define TX_REPEATS_READY            (TX_REPEATS_INF)
#define TX_REPEATS_DATA             (TX_REPEATS_DEFAULT)
#define TX_REPEATS_RSP              (TX_REPEATS_DEFAULT)
#define TX_REPEATS_REQ              (TX_REPEATS_DEFAULT)
#define TX_REPEATS_START            (TX_REPEATS_DEFAULT);

#define TX_INTERVAL_TYPE_FWID       (BL_RADIO_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_DFU_REQ    (BL_RADIO_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_READY      (BL_RADIO_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_DATA       (BL_RADIO_INTERVAL_TYPE_EXPONENTIAL)
#define TX_INTERVAL_TYPE_RSP        (BL_RADIO_INTERVAL_TYPE_EXPONENTIAL)
#define TX_INTERVAL_TYPE_REQ        (BL_RADIO_INTERVAL_TYPE_REGULAR)

#define STATE_TIMEOUT_FIND_FWID     ( 5000000) /*  5.0s */
#define STATE_TIMEOUT_REQ           ( 1000000) /*  1.0s */
#define STATE_TIMEOUT_READY         ( 3000000) /*  3.0s */
#define STATE_TIMEOUT_TARGET        ( 5000000) /*  5.0s */
#define STATE_TIMEOUT_RAMPDOWN      ( 1000000) /*  1.0s */
#define STATE_TIMEOUT_RELAY         (10000000) /* 10.0s */

#define TX_SLOT_BEACON              (0)    

#define START_ADDRESS_UNKNOWN       (0xFFFFFFFF)

#define PACKET_CACHE_SIZE           (16)

#define REQ_CACHE_SIZE              (4)
#define TRANSACTION_ID_CACHE_SIZE   (8)
#define REQ_RX_COUNT_RETRY          (8)

/*****************************************************************************
* Local typedefs
*****************************************************************************/
typedef enum
{
    BEACON_TYPE_FWID,
    BEACON_TYPE_READY_APP,
    BEACON_TYPE_READY_SD,
    BEACON_TYPE_READY_BL
} beacon_type_t;

typedef struct
{
    uint32_t        transaction_id;
    uint8_t         authority;
    dfu_type_t      type;
    uint32_t*       p_start_addr; /* duplicate */
    uint32_t*       p_bank_addr; /* duplicate */
    uint32_t*       p_indicated_start_addr;
    uint32_t*       p_last_requested_entry;
    uint32_t        length; /* duplicate */
    uint32_t        signature_length; /* redundant */
    uint8_t         signature[DFU_SIGNATURE_LEN];
    uint8_t         signature_bitmap;
    uint16_t        segments_remaining; /* redundant? */
    uint16_t        segment_count; /* redundant */
    fwid_union_t    target_fwid_union;
    bool            segment_is_valid_after_transfer;
    bool            flood;
} transaction_t;

typedef struct
{
    bl_info_version_t*      p_fwid;
    bl_info_segment_t*      p_segment_sd;
    bl_info_segment_t*      p_segment_bl;
    bl_info_segment_t*      p_segment_app;
    bl_info_flags_t*        p_flags;
    uint8_t*                p_ecdsa_public_key;
    uint8_t*                p_signature_sd;
    uint8_t*                p_signature_bl;
    uint8_t*                p_signature_app;
    uint8_t*                p_signature_bl_info;
} bl_info_pointers_t;

typedef struct
{
    uint16_t segment;
    uint16_t rx_count;
} req_cache_entry_t;

typedef struct
{
    dfu_packet_type_t   type;
    uint16_t            segment;
} packet_cache_entry_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
static transaction_t            m_transaction;
static dfu_state_t              m_state = DFU_STATE_FIND_FWID;
static bl_info_pointers_t       m_bl_info_pointers;
static req_cache_entry_t        m_req_cache[REQ_CACHE_SIZE];
static uint8_t                  m_req_index;
static uint32_t                 m_tid_cache[TRANSACTION_ID_CACHE_SIZE];
static uint8_t                  m_tid_index;
static packet_cache_entry_t     m_packet_cache[PACKET_CACHE_SIZE];
static uint32_t                 m_packet_cache_index;
static uint8_t                  m_tx_slots;
/*****************************************************************************
* Static Functions
*****************************************************************************/
static beacon_type_t state_beacon_type(dfu_type_t transfer_type)
{
    switch (transfer_type)
    {
        case DFU_TYPE_APP:
            return BEACON_TYPE_READY_APP;
        case DFU_TYPE_BOOTLOADER:
            return BEACON_TYPE_READY_BL;
        case DFU_TYPE_SD:
            return BEACON_TYPE_READY_SD;
        default:
            return BEACON_TYPE_FWID;
    }
}

static void packet_tx_dynamic(dfu_packet_t* p_packet, 
    uint32_t length, 
    bl_radio_interval_type_t interval_type, 
    uint8_t repeats)
{
    static uint8_t tx_slot = 1;
    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = p_packet;
    tx_evt.params.tx.radio.length = length;
    tx_evt.params.tx.radio.interval_type = interval_type;
    tx_evt.params.tx.radio.tx_count = repeats;
    tx_evt.params.tx.radio.tx_slot = tx_slot;
    bootloader_evt_send(&tx_evt);
    
    if (++tx_slot >= m_tx_slots)
    {
        tx_slot = 1;
    }
}

static bool packet_is_from_serial(void* p_packet)
{
#ifdef SERIAL
    /* serial packets will have the device's own address as source */

    return (memcmp(mesh_packet_get_aligned(p_packet)->addr, (const uint8_t*) &NRF_FICR->DEVICEADDR[0], BLE_GAP_ADDR_LEN) == 0);
#else
    return false;
#endif
}

static bool fwid_union_cmp(fwid_union_t* p_a, fwid_union_t* p_b, dfu_type_t dfu_type)
{
    switch (dfu_type)
    {
        case DFU_TYPE_APP:
            return memcmp(&p_a->app,
                          &p_b->app,
                          sizeof(app_id_t)) == 0;
        case DFU_TYPE_SD:
            return (p_a->sd == p_b->sd);
        case DFU_TYPE_BOOTLOADER:
            return memcmp(&p_a->bootloader,
                          &p_b->bootloader,
                          sizeof(bl_id_t)) == 0;
        default: return false;
    }
}

