NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
static bool signature_check(void)
{
    /* if we don't have a public key we will accept all firmware upgrades. */
    if (m_bl_info_pointers.p_ecdsa_public_key == NULL)
    {
        return true;
    }

    /* if we have a key, but the transfer isn't signed, we will fail */
    if (m_transaction.signature_length == 0)
    {
        return false;
    }

    uint8_t hash[uECC_BYTES];
    sha256_context_t hash_context;
    sha256_init(&hash_context);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.type, 1);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.p_indicated_start_addr, 4);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.length, 4);
    uint8_t padding = 0;
    sha256_update(&hash_context, &padding, 1);

    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_APP);
            break;
        case DFU_TYPE_SD:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_SD);
            break;
        case DFU_TYPE_BOOTLOADER:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_BL);
            break;
        default:
            break;
    }

    dfu_transfer_sha256(&hash_context);

    sha256_final(&hash_context, hash);
    return (bool) (uECC_verify(m_bl_info_pointers.p_ecdsa_public_key, hash, m_transaction.signature));
}

static bool ready_packet_is_upgrade(dfu_packet_t* p_packet)
{
    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }

    switch (p_packet->payload.state.dfu_type)
    {
        case DFU_TYPE_APP:
            return (p_packet->payload.state.fwid.app.app_id == m_bl_info_pointers.p_fwid->app.app_id &&
                    p_packet->payload.state.fwid.app.company_id== m_bl_info_pointers.p_fwid->app.company_id &&
                    p_packet->payload.state.fwid.app.app_version > m_bl_info_pointers.p_fwid->app.app_version);

        case DFU_TYPE_BOOTLOADER:
            return (p_packet->payload.state.fwid.bootloader.id ==
                    m_bl_info_pointers.p_fwid->bootloader.id &&
                    p_packet->payload.state.fwid.bootloader.ver >
                    m_bl_info_pointers.p_fwid->bootloader.ver);

        case DFU_TYPE_SD:
            return (p_packet->payload.state.fwid.sd ==
                    m_bl_info_pointers.p_fwid->sd);
        default:
            return false;
    }
}

static bool ready_packet_matches_our_req(dfu_packet_t* p_packet)
{
    if (p_packet->payload.state.dfu_type != m_transaction.type && m_transaction.type != DFU_TYPE_NONE)
    {
        return false;
    }

    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }
    return fwid_union_cmp(&p_packet->payload.state.fwid,
                   &m_transaction.target_fwid_union,
                   m_transaction.type);
}

static void beacon_set(beacon_type_t type)
{
    dfu_packet_t dfu_packet;
    memset(&dfu_packet, 0, sizeof(dfu_packet_t));

    uint8_t repeats = TX_REPEATS_FWID;
    bl_radio_interval_type_t interval_type = TX_INTERVAL_TYPE_FWID;
    uint8_t length = 0;

    if (type >= BEACON_TYPE_READY_APP &&
        type <= BEACON_TYPE_READY_BL)
    {
        dfu_packet.packet_type = DFU_PACKET_TYPE_STATE;
        dfu_packet.payload.state.authority = m_transaction.authority;
        dfu_packet.payload.state.flood = m_transaction.flood;
        dfu_packet.payload.state.transaction_id = m_transaction.transaction_id;
        dfu_packet.payload.state.relay_node = (m_state == DFU_STATE_RELAY_CANDIDATE);
        dfu_packet.payload.state.fwid = m_transaction.target_fwid_union;
        repeats = TX_REPEATS_READY;
        interval_type = TX_INTERVAL_TYPE_READY;
    }

    switch (type)
    {
        case BEACON_TYPE_FWID:
            length = DFU_PACKET_LEN_FWID;
            dfu_packet.packet_type = DFU_PACKET_TYPE_FWID;
            dfu_packet.payload.fwid = *m_bl_info_pointers.p_fwid;
            break;

        case BEACON_TYPE_READY_APP:
            length = DFU_PACKET_LEN_STATE_APP;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_APP;
            break;

        case BEACON_TYPE_READY_SD:
            length = DFU_PACKET_LEN_STATE_SD;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_SD;
            break;

        case BEACON_TYPE_READY_BL:
            length = DFU_PACKET_LEN_STATE_BL;
            dfu_packet.payload.state.dfu_type = DFU_TYPE_BOOTLOADER;
            break;
    }
    
    bl_evt_t tx_evt;
    tx_evt.type = BL_EVT_TYPE_TX_RADIO;
    tx_evt.params.tx.radio.p_dfu_packet = &dfu_packet;
    tx_evt.params.tx.radio.length = length;
    tx_evt.params.tx.radio.interval_type = interval_type;
    tx_evt.params.tx.radio.tx_count = repeats;
    tx_evt.params.tx.radio.tx_slot = TX_SLOT_BEACON;
    
    bootloader_evt_send(&tx_evt);
    
#ifdef SERIAL
    tx_evt.type = BL_EVT_TYPE_TX_SERIAL;
    tx_evt.params.tx.serial.p_dfu_packet = &dfu_packet;
    tx_evt.params.tx.serial.length = length;
    bootloader_evt_send(&tx_evt);
#endif
}

static inline uint32_t* addr_from_seg(uint16_t segment)
{
    if (segment == 1)
    {
        return m_transaction.p_start_addr;
    }
    else
    {
        return (uint32_t*) (((segment - 1) << 4) + ((uint32_t) m_transaction.p_start_addr & 0xFFFFFFF0));
    }
}

static bool app_is_newer(app_id_t* p_app_id)
{
    return (p_app_id->app_id     == m_bl_info_pointers.p_fwid->app.app_id &&
            p_app_id->company_id == m_bl_info_pointers.p_fwid->app.company_id &&
            p_app_id->app_version > m_bl_info_pointers.p_fwid->app.app_version);
}

static bool bootloader_is_newer(bl_id_t bl_id)
{
    return (bl_id.id == m_bl_info_pointers.p_fwid->bootloader.id &&
            bl_id.ver > m_bl_info_pointers.p_fwid->bootloader.ver);
}

