NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
/********** STATE MACHINE ENTRY POINTS ***********/
static void start_find_fwid(void)
{
    beacon_set(BEACON_TYPE_FWID);
    timer_set(STATE_TIMEOUT_FIND_FWID);
    m_state = DFU_STATE_FIND_FWID;
    memset(&m_transaction, 0, sizeof(transaction_t));
}

static void start_req(dfu_type_t type, bool timeout)
{
    m_transaction.authority = 0;
    m_transaction.length = 0;
    m_transaction.p_bank_addr = NULL;
    m_transaction.p_start_addr = NULL;
    m_transaction.segments_remaining = 0xFFFF;
    m_transaction.segment_count = 0;
    m_transaction.segment_is_valid_after_transfer = false;
    m_transaction.signature_length = 0;
    m_transaction.transaction_id = 0;
    m_transaction.type = type;
    if (timeout)
    {
        timer_set(STATE_TIMEOUT_REQ);
    }
    m_state = DFU_STATE_DFU_REQ;

    beacon_set(state_beacon_type(type));
}

static void start_ready(dfu_packet_t* p_ready_packet)
{
    if (p_ready_packet->packet_type != DFU_PACKET_TYPE_STATE ||
        p_ready_packet->payload.state.authority == 0 ||
        p_ready_packet->payload.state.dfu_type != m_transaction.type)
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }
    m_transaction.transaction_id = p_ready_packet->payload.state.transaction_id;
    m_transaction.authority = p_ready_packet->payload.state.authority;
    m_transaction.flood = p_ready_packet->payload.state.flood;
    timer_set(STATE_TIMEOUT_READY);
    m_state = DFU_STATE_DFU_READY;

    beacon_set(state_beacon_type(m_transaction.type));
}

static void start_target(void)
{
    timer_set(STATE_TIMEOUT_TARGET);
    m_state = DFU_STATE_DFU_TARGET;

    uint32_t segment_size = 0;
    bl_info_entry_t flags_entry;
    memset(&flags_entry, 0xFF, (BL_INFO_LEN_FLAGS + 3) & ~0x03UL);

    switch (m_transaction.type)
    {
        case DFU_TYPE_SD:
            segment_size = m_bl_info_pointers.p_segment_sd->length;
            flags_entry.flags.sd_intact = false;
            break;
        case DFU_TYPE_APP:
            segment_size = m_bl_info_pointers.p_segment_app->length;
            flags_entry.flags.app_intact = false;
            break;
        case DFU_TYPE_BOOTLOADER:
            segment_size = m_bl_info_pointers.p_segment_bl->length;
            flags_entry.flags.bl_intact = false;

            /* check whether we're destroying the application: */
            for (uint32_t* p_addr = m_transaction.p_bank_addr;
                 p_addr < (uint32_t*) (m_bl_info_pointers.p_segment_app->start + m_bl_info_pointers.p_segment_app->length);
                 p_addr++)
            {
                if (*p_addr != 0xFFFFFFFF)
                {
                    flags_entry.flags.app_intact = false;
                }
            }
            break;
        default:
            segment_size = 0;
    }

    /* Tag the transfer as incomplete in device page if we're about to overwrite it. */
    if (m_transaction.p_start_addr == m_transaction.p_bank_addr)
    {
        if (m_bl_info_pointers.p_flags == NULL)
        {
            m_bl_info_pointers.p_flags = &bootloader_info_entry_put(BL_INFO_TYPE_FLAGS, &flags_entry, BL_INFO_LEN_FLAGS)->flags;
        }
        else
        {
            /* update inline */
            if (flash_write(
                    (uint32_t*) m_bl_info_pointers.p_flags,
                    (uint8_t*) &flags_entry,
                    (BL_INFO_LEN_FLAGS + 3) & ~0x03UL) != NRF_SUCCESS)
            {
                start_req(m_transaction.type, true);
            }
        }
    }

    if (dfu_transfer_start(
            m_transaction.p_start_addr,
            m_transaction.p_bank_addr,
            m_transaction.length,
            segment_size,
            m_transaction.segment_is_valid_after_transfer) != NRF_SUCCESS)
    {
        start_req(m_transaction.type, true);
    }
    else
    {
        bl_evt_t send_abort_evt_evt;
        send_abort_evt_evt.type = BL_EVT_TYPE_TX_ABORT;
        send_abort_evt_evt.params.tx.abort.tx_slot = TX_SLOT_BEACON;
        bootloader_evt_send(&send_abort_evt_evt);
    }
}

static void start_rampdown(void)
{
    /* the final timeout should be set regardless of NO_TIMEOUTS flag. */
    bl_evt_t timer_evt;
    timer_evt.type = BL_EVT_TYPE_TIMER_SET;
    timer_evt.params.timer.set.delay_us = STATE_TIMEOUT_RAMPDOWN;
    timer_evt.params.timer.set.index = 0;
    bootloader_evt_send(&timer_evt);
    
    m_state = DFU_STATE_VALIDATE;
}

static void start_relay_candidate(dfu_packet_t* p_packet)
{
    timer_set(STATE_TIMEOUT_RELAY);

    m_transaction.authority = p_packet->payload.state.authority;
    m_transaction.transaction_id = p_packet->payload.state.transaction_id;
    m_transaction.target_fwid_union = p_packet->payload.state.fwid;
    m_state = DFU_STATE_RELAY_CANDIDATE;

    beacon_set(state_beacon_type(m_transaction.type));
}


static bool packet_in_cache(dfu_packet_t* p_packet)
{
    for (uint32_t i = 0; i < PACKET_CACHE_SIZE; ++i)
    {
        if (m_packet_cache[i].type    == p_packet->packet_type &&
            m_packet_cache[i].segment == p_packet->payload.data.segment)
        {
            return true;
        }
    }
    return false;
}

static void packet_cache_put(dfu_packet_t* p_packet)
{
    m_packet_cache[(m_packet_cache_index) & (PACKET_CACHE_SIZE - 1)].type = (dfu_packet_type_t) p_packet->packet_type;
    m_packet_cache[(m_packet_cache_index) & (PACKET_CACHE_SIZE - 1)].segment = p_packet->payload.data.segment;
    m_packet_cache_index++;
}

static void relay_packet(dfu_packet_t* p_packet, uint16_t length)
{
    mesh_packet_t* p_mesh_packet = mesh_packet_get_aligned(p_packet);
    if (!p_mesh_packet)
    {
        if (!mesh_packet_acquire(&p_mesh_packet))
        {
            APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
        }
        mesh_packet_build(
            p_mesh_packet,
            p_packet->packet_type,
            p_packet->payload.data.segment,
            (uint8_t*) &p_packet->payload.data.transaction_id,
            length - 4);
    }
    else
    {
        mesh_packet_ref_count_inc(p_mesh_packet);
    }

    packet_tx_dynamic(p_packet, length, TX_INTERVAL_TYPE_DATA, TX_REPEATS_DATA);
    packet_cache_put(p_packet);
    mesh_packet_ref_count_dec(p_mesh_packet);
}

static void handle_data_packet(dfu_packet_t* p_packet, uint16_t length)
{
    bool do_relay = false;
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        /* check and add to cache */
        if (packet_in_cache(p_packet))
        {
            return;
        }

        if (m_state == DFU_STATE_DFU_READY)
        {
            if (p_packet->payload.start.segment == 0)
            {
                bl_info_segment_t* p_segment = NULL;
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        p_segment = m_bl_info_pointers.p_segment_app;
                        break;
                    case DFU_TYPE_SD:
                        p_segment = m_bl_info_pointers.p_segment_sd;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        p_segment = m_bl_info_pointers.p_segment_bl;
                        break;
                    default:
                        APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
                }

