NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/core/dfu_mesh.c
}

uint32_t dfu_mesh_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
#ifdef DEBUG_LEDS
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = (1 << 22);
    }
    else
    {
        NRF_GPIO->OUTSET = (1 << 22);
    }
    led = !led;
    NRF_GPIO->OUTSET = (1 << 1);
#endif

    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            handle_data_packet(p_packet, length);
            break;

        case DFU_PACKET_TYPE_DATA_REQ:
            handle_data_req_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA_RSP:
            handle_data_rsp_packet(p_packet, length);
            break;

        default:
            /* don't care */
            break;
    }
#ifdef DEBUG_LEDS
    NRF_GPIO->OUTCLR = (1 << 1);
#endif
    return NRF_SUCCESS;
}

void dfu_mesh_timeout(void)
{
    switch (m_state)
    {
        case DFU_STATE_FIND_FWID:
            send_abort_evt(BL_END_FWID_VALID);
            break;

        case DFU_STATE_DFU_REQ:
        case DFU_STATE_DFU_READY:
            send_abort_evt(BL_END_ERROR_NO_START);
            break;

        case DFU_STATE_DFU_TARGET:
            start_req(m_transaction.type, true);
            break;

        case DFU_STATE_VALIDATE:
            if (signature_check())
            {
                bl_evt_t end_evt;
                end_evt.type = BL_EVT_TYPE_END_TARGET;
                end_evt.params.end.dfu_type = m_transaction.type;
                memcpy(&end_evt.params.end.fwid, &m_transaction.target_fwid_union, sizeof(fwid_union_t));
                bootloader_evt_send(&end_evt);
                //dfu_mesh_finalize();
            }
            else
            {
                /* someone gave us unauthorized firmware, and we're broken.
                   need to reboot and try to request a new transfer */
                send_abort_evt(BL_END_ERROR_UNAUTHORIZED);
            }
            break;
        case DFU_STATE_RELAY:
        case DFU_STATE_RELAY_CANDIDATE:
            send_abort_evt(BL_END_SUCCESS);
            break;
        default:
            break;
    }
}

bool dfu_mesh_app_is_valid(uint32_t* p_app_start)
{
    bl_info_entry_t* p_fwid_entry    = bootloader_info_entry_get((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_FLAGS);

    return (p_fwid_entry != NULL &&
            p_app_start != (uint32_t*) 0xFFFFFFFF &&
            *p_app_start != 0xFFFFFFFF &&
            p_fwid_entry->version.app.app_version != APP_VERSION_INVALID &&
            fw_is_verified());
}

uint32_t dfu_mesh_finalize(void)
{
    /* write new version in bl info: */
    bl_info_entry_t new_version_entry;
    memcpy(&new_version_entry.version, m_bl_info_pointers.p_fwid, sizeof(fwid_t));
    bl_info_type_t sign_info_type = BL_INFO_TYPE_INVALID;

    if (m_bl_info_pointers.p_flags == NULL)
    {
        APP_ERROR_CHECK(NRF_ERROR_NULL);
    }

    /* copy flags, then mark the type we just verified as intact before reflashing it. */
    bl_info_entry_t flags_entry;
    memcpy(&flags_entry, m_bl_info_pointers.p_flags, ((BL_INFO_LEN_FLAGS + 3) & ~0x03UL));

    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            memcpy((void*) &new_version_entry.version.app, (void*) &m_transaction.target_fwid_union.app, DFU_FWID_LEN_APP);
            sign_info_type = BL_INFO_TYPE_SIGNATURE_APP;
            flags_entry.flags.app_intact = true;
            break;
        case DFU_TYPE_SD:
            memcpy((void*) &new_version_entry.version.sd, (void*) &m_transaction.target_fwid_union.sd, DFU_FWID_LEN_SD);
            sign_info_type = BL_INFO_TYPE_SIGNATURE_SD;
            flags_entry.flags.sd_intact = true;
            break;
        case DFU_TYPE_BOOTLOADER:
            memcpy((void*) &new_version_entry.version.bootloader, (void*) &m_transaction.target_fwid_union.bootloader, DFU_FWID_LEN_BL);
            sign_info_type = BL_INFO_TYPE_SIGNATURE_BL;
            flags_entry.flags.bl_intact = true;
            break;
        default:
            break;
    }
    m_bl_info_pointers.p_fwid  = &bootloader_info_entry_put(BL_INFO_TYPE_VERSION, &new_version_entry, BL_INFO_LEN_FWID)->version;
    m_bl_info_pointers.p_flags = &bootloader_info_entry_put(BL_INFO_TYPE_FLAGS, &flags_entry, BL_INFO_LEN_FLAGS)->flags;

    /* add signature to bl info, if applicable: */
    if (m_transaction.signature_length != 0)
    {
        bootloader_info_entry_put(sign_info_type, (bl_info_entry_t*) m_transaction.signature, DFU_SIGNATURE_LEN);
    }
    
    switch (m_transaction.type)
    {
        case DFU_TYPE_BOOTLOADER:
        {
            /* move the bank with MBR. NRF_UICR->BOOTLOADERADDR must have been set. */
            sd_mbr_command_t sd_mbr_cmd;

            sd_mbr_cmd.command               = SD_MBR_COMMAND_COPY_BL;
            sd_mbr_cmd.params.copy_bl.bl_src = m_transaction.p_bank_addr;
            sd_mbr_cmd.params.copy_bl.bl_len = m_transaction.length / sizeof(uint32_t);

            if (sd_mbr_command(&sd_mbr_cmd) != NRF_SUCCESS)
            {
                send_abort_evt(BL_END_ERROR_MBR_CALL_FAILED);
            }
        }
            break;
        case DFU_TYPE_SD:
        {
            /* move the bank with MBR. NRF_UICR->BOOTLOADERADDR must have been set. */
            sd_mbr_command_t sd_mbr_cmd;

            sd_mbr_cmd.command               = SD_MBR_COMMAND_COPY_BL;
            sd_mbr_cmd.params.copy_bl.bl_src = m_transaction.p_bank_addr;
            sd_mbr_cmd.params.copy_bl.bl_len = m_transaction.length / sizeof(uint32_t);

            if (sd_mbr_command(&sd_mbr_cmd) != NRF_SUCCESS)
            {
                send_abort_evt(BL_END_ERROR_MBR_CALL_FAILED);
            }
        }
            break;
        default:
            /* This nukes the call stack. */
            dfu_transfer_flash_bank();
            
            ///@TODO: Mark the target as intact.
            
            /* Let's just kill ourself! */
            NVIC_SystemReset();        
    }
}